case/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application         interFoam;
startFrom           startTime;
startTime           0;
stopAt              endTime;
endTime             14.0;
deltaT              0.001;
writeControl        adjustableRunTime;
writeInterval       1.0;
purgeWrite          1;
writeFormat         binary;
writePrecision      10;
writeCompression    off;
timeFormat          general;
timePrecision       8;
runTimeModifiable   false;
adjustTimeStep      yes;
maxCo               0.45;
maxAlphaCo          0.30;
maxDeltaT           0.005;

functions
{
    gaugeHeights
    {
        type                interfaceHeight;
        libs                (fieldFunctionObjects);
        alpha               alpha.water;
        liquid              true;
        direction           (0 0 -1);
        interpolationScheme cellPoint;
        locations
        (
            (5.00000100 0.005 0.000001)
            (5.50000100 0.005 0.000001)
            (6.00000100 0.005 0.000001)
            (6.50000100 0.005 0.000001)
            (6.99375000 0.005 0.000001)
            (8.00625000 0.005 0.000001)
            (9.00000100 0.005 0.000001)
            (10.20000100 0.005 0.000001)
        );
        writePrecision      12;
        executeControl      adjustableRunTime;
        executeInterval     0.01;
        writeControl        adjustableRunTime;
        writeInterval       0.01;
    }

    profileHeights
    {
        type                interfaceHeight;
        libs                (fieldFunctionObjects);
        alpha               alpha.water;
        liquid              true;
        direction           (0 0 -1);
        interpolationScheme cellPoint;
        locations
        (
            (5.00000100 0.005 0.000001)
            (5.02000100 0.005 0.000001)
            (5.04000100 0.005 0.000001)
            (5.06000100 0.005 0.000001)
            (5.08000100 0.005 0.000001)
            (5.10000100 0.005 0.000001)
            (5.12000100 0.005 0.000001)
            (5.14000100 0.005 0.000001)
            (5.16000100 0.005 0.000001)
            (5.18000100 0.005 0.000001)
            (5.20000100 0.005 0.000001)
            (5.22000100 0.005 0.000001)
            (5.24000100 0.005 0.000001)
            (5.26000100 0.005 0.000001)
            (5.28000100 0.005 0.000001)
            (5.30000100 0.005 0.000001)
            (5.32000100 0.005 0.000001)
            (5.34000100 0.005 0.000001)
            (5.36000100 0.005 0.000001)
            (5.38000100 0.005 0.000001)
            (5.40000100 0.005 0.000001)
            (5.42000100 0.005 0.000001)
            (5.44000100 0.005 0.000001)
            (5.46000100 0.005 0.000001)
            (5.48000100 0.005 0.000001)
            (5.50000100 0.005 0.000001)
            (5.52000100 0.005 0.000001)
            (5.54000100 0.005 0.000001)
            (5.56000100 0.005 0.000001)
            (5.58000100 0.005 0.000001)
            (5.60000100 0.005 0.000001)
            (5.62000100 0.005 0.000001)
            (5.64000100 0.005 0.000001)
            (5.66000100 0.005 0.000001)
            (5.68000100 0.005 0.000001)
            (5.70000100 0.005 0.000001)
            (5.72000100 0.005 0.000001)
            (5.74000100 0.005 0.000001)
            (5.76000100 0.005 0.000001)
            (5.78000100 0.005 0.000001)
            (5.80000100 0.005 0.000001)
            (5.82000100 0.005 0.000001)
            (5.84000100 0.005 0.000001)
            (5.86000100 0.005 0.000001)
            (5.88000100 0.005 0.000001)
            (5.90000100 0.005 0.000001)
            (5.92000100 0.005 0.000001)
            (5.94000100 0.005 0.000001)
            (5.96000100 0.005 0.000001)
            (5.98000100 0.005 0.000001)
            (6.00000100 0.005 0.000001)
            (6.02000100 0.005 0.000001)
            (6.04000100 0.005 0.000001)
            (6.06000100 0.005 0.000001)
            (6.08000100 0.005 0.000001)
            (6.10000100 0.005 0.000001)
            (6.12000100 0.005 0.000001)
            (6.14000100 0.005 0.000001)
            (6.16000100 0.005 0.000001)
            (6.18000100 0.005 0.000001)
            (6.20000100 0.005 0.000001)
            (6.22000100 0.005 0.000001)
            (6.24000100 0.005 0.000001)
            (6.26000100 0.005 0.000001)
            (6.28000100 0.005 0.000001)
            (6.30000100 0.005 0.000001)
            (6.32000100 0.005 0.000001)
            (6.34000100 0.005 0.000001)
            (6.36000100 0.005 0.000001)
            (6.38000100 0.005 0.000001)
            (6.40000100 0.005 0.000001)
            (6.42000100 0.005 0.000001)
            (6.44000100 0.005 0.000001)
            (6.46000100 0.005 0.000001)
            (6.48000100 0.005 0.000001)
            (6.50000100 0.005 0.000001)
            (6.52000100 0.005 0.000001)
            (6.54000100 0.005 0.000001)
            (6.56000100 0.005 0.000001)
            (6.58000100 0.005 0.000001)
            (6.60000100 0.005 0.000001)
            (6.62000100 0.005 0.000001)
            (6.64000100 0.005 0.000001)
            (6.66000100 0.005 0.000001)
            (6.68000100 0.005 0.000001)
            (6.70000100 0.005 0.000001)
            (6.72000100 0.005 0.000001)
            (6.74000100 0.005 0.000001)
            (6.76000100 0.005 0.000001)
            (6.78000100 0.005 0.000001)
            (6.80000100 0.005 0.000001)
            (6.82000100 0.005 0.000001)
            (6.84000100 0.005 0.000001)
            (6.86000100 0.005 0.000001)
            (6.88000100 0.005 0.000001)
            (6.90000100 0.005 0.000001)
            (6.92000100 0.005 0.000001)
            (6.94000100 0.005 0.000001)
            (6.96000100 0.005 0.000001)
            (6.98000100 0.005 0.000001)
            (6.99375000 0.005 0.000001)
            (7.02000100 0.005 0.050001)
            (7.04000100 0.005 0.050001)
            (7.06000100 0.005 0.050001)
            (7.08000100 0.005 0.050001)
            (7.10000100 0.005 0.050001)
            (7.12000100 0.005 0.050001)
            (7.14000100 0.005 0.050001)
            (7.16000100 0.005 0.050001)
            (7.18000100 0.005 0.050001)
            (7.20000100 0.005 0.050001)
            (7.22000100 0.005 0.050001)
            (7.24000100 0.005 0.050001)
            (7.26000100 0.005 0.050001)
            (7.28000100 0.005 0.050001)
            (7.30000100 0.005 0.050001)
            (7.32000100 0.005 0.050001)
            (7.34000100 0.005 0.050001)
            (7.36000100 0.005 0.050001)
            (7.38000100 0.005 0.050001)
            (7.40000100 0.005 0.050001)
            (7.42000100 0.005 0.050001)
            (7.44000100 0.005 0.050001)
            (7.46000100 0.005 0.050001)
            (7.48000100 0.005 0.050001)
            (7.50000100 0.005 0.050001)
            (7.52000100 0.005 0.050001)
            (7.54000100 0.005 0.050001)
            (7.56000100 0.005 0.050001)
            (7.58000100 0.005 0.050001)
            (7.60000100 0.005 0.050001)
            (7.62000100 0.005 0.050001)
            (7.64000100 0.005 0.050001)
            (7.66000100 0.005 0.050001)
            (7.68000100 0.005 0.050001)
            (7.70000100 0.005 0.050001)
            (7.72000100 0.005 0.050001)
            (7.74000100 0.005 0.050001)
            (7.76000100 0.005 0.050001)
            (7.78000100 0.005 0.050001)
            (7.80000100 0.005 0.050001)
            (7.82000100 0.005 0.050001)
            (7.84000100 0.005 0.050001)
            (7.86000100 0.005 0.050001)
            (7.88000100 0.005 0.050001)
            (7.90000100 0.005 0.050001)
            (7.92000100 0.005 0.050001)
            (7.94000100 0.005 0.050001)
            (7.96000100 0.005 0.050001)
            (7.98000100 0.005 0.050001)
            (8.00625000 0.005 0.000001)
            (8.02000100 0.005 0.000001)
            (8.04000100 0.005 0.000001)
            (8.06000100 0.005 0.000001)
            (8.08000100 0.005 0.000001)
            (8.10000100 0.005 0.000001)
            (8.12000100 0.005 0.000001)
            (8.14000100 0.005 0.000001)
            (8.16000100 0.005 0.000001)
            (8.18000100 0.005 0.000001)
            (8.20000100 0.005 0.000001)
            (8.22000100 0.005 0.000001)
            (8.24000100 0.005 0.000001)
            (8.26000100 0.005 0.000001)
            (8.28000100 0.005 0.000001)
            (8.30000100 0.005 0.000001)
            (8.32000100 0.005 0.000001)
            (8.34000100 0.005 0.000001)
            (8.36000100 0.005 0.000001)
            (8.38000100 0.005 0.000001)
            (8.40000100 0.005 0.000001)
            (8.42000100 0.005 0.000001)
            (8.44000100 0.005 0.000001)
            (8.46000100 0.005 0.000001)
            (8.48000100 0.005 0.000001)
            (8.50000100 0.005 0.000001)
            (8.52000100 0.005 0.000001)
            (8.54000100 0.005 0.000001)
            (8.56000100 0.005 0.000001)
            (8.58000100 0.005 0.000001)
            (8.60000100 0.005 0.000001)
            (8.62000100 0.005 0.000001)
            (8.64000100 0.005 0.000001)
            (8.66000100 0.005 0.000001)
            (8.68000100 0.005 0.000001)
            (8.70000100 0.005 0.000001)
            (8.72000100 0.005 0.000001)
            (8.74000100 0.005 0.000001)
            (8.76000100 0.005 0.000001)
            (8.78000100 0.005 0.000001)
            (8.80000100 0.005 0.000001)
            (8.82000100 0.005 0.000001)
            (8.84000100 0.005 0.000001)
            (8.86000100 0.005 0.000001)
            (8.88000100 0.005 0.000001)
            (8.90000100 0.005 0.000001)
            (8.92000100 0.005 0.000001)
            (8.94000100 0.005 0.000001)
            (8.96000100 0.005 0.000001)
            (8.98000100 0.005 0.000001)
            (9.00000100 0.005 0.000001)
            (9.02000100 0.005 0.000001)
            (9.04000100 0.005 0.000001)
            (9.06000100 0.005 0.000001)
            (9.08000100 0.005 0.000001)
            (9.10000100 0.005 0.000001)
            (9.12000100 0.005 0.000001)
            (9.14000100 0.005 0.000001)
            (9.16000100 0.005 0.000001)
            (9.18000100 0.005 0.000001)
            (9.20000100 0.005 0.000001)
            (9.22000100 0.005 0.000001)
            (9.24000100 0.005 0.000001)
            (9.26000100 0.005 0.000001)
            (9.28000100 0.005 0.000001)
            (9.30000100 0.005 0.000001)
            (9.32000100 0.005 0.000001)
            (9.34000100 0.005 0.000001)
            (9.36000100 0.005 0.000001)
            (9.38000100 0.005 0.000001)
            (9.40000100 0.005 0.000001)
            (9.42000100 0.005 0.000001)
            (9.44000100 0.005 0.000001)
            (9.46000100 0.005 0.000001)
            (9.48000100 0.005 0.000001)
            (9.50000100 0.005 0.000001)
            (9.52000100 0.005 0.000001)
            (9.54000100 0.005 0.000001)
            (9.56000100 0.005 0.000001)
            (9.58000100 0.005 0.000001)
            (9.60000100 0.005 0.000001)
            (9.62000100 0.005 0.000001)
            (9.64000100 0.005 0.000001)
            (9.66000100 0.005 0.000001)
            (9.68000100 0.005 0.000001)
            (9.70000100 0.005 0.000001)
            (9.72000100 0.005 0.000001)
            (9.74000100 0.005 0.000001)
            (9.76000100 0.005 0.000001)
            (9.78000100 0.005 0.000001)
            (9.80000100 0.005 0.000001)
            (9.82000100 0.005 0.000001)
            (9.84000100 0.005 0.000001)
            (9.86000100 0.005 0.000001)
            (9.88000100 0.005 0.000001)
            (9.90000100 0.005 0.000001)
            (9.92000100 0.005 0.000001)
            (9.94000100 0.005 0.000001)
            (9.96000100 0.005 0.000001)
            (9.98000100 0.005 0.000001)
            (10.00000100 0.005 0.000001)
            (10.02000100 0.005 0.000001)
            (10.04000100 0.005 0.000001)
            (10.06000100 0.005 0.000001)
            (10.08000100 0.005 0.000001)
            (10.10000100 0.005 0.000001)
            (10.12000100 0.005 0.000001)
            (10.14000100 0.005 0.000001)
            (10.16000100 0.005 0.000001)
            (10.18000100 0.005 0.000001)
            (10.20000100 0.005 0.000001)
        );
        writePrecision      12;
        executeControl      adjustableRunTime;
        executeInterval     0.05;
        writeControl        adjustableRunTime;
        writeInterval       0.05;
    }

    waterVolume
    {
        type                volFieldValue;
        libs                (fieldFunctionObjects);
        fields              (alpha.water);
        operation           volIntegrate;
        writeFields         false;
        writePrecision      12;
        executeControl      adjustableRunTime;
        executeInterval     0.05;
        writeControl        adjustableRunTime;
        writeInterval       0.05;
    }
}
