case/constant/turbulenceProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
simulationType  laminar;

